Documents/ДобавлениеДанныхГражданином.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ДобавлениеДанныхГражданином</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Вопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Вопросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вопросы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПерсональныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ПерсональныеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрачныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОНациональность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОНациональность</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Национальность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЯзык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Религия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеЯзыки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОСемье.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОСемье</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЧленСемьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЧленаСемьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отношение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОРаботе</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЭкономическойАктичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодЗанятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВозможнойРаботоспособности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеООбразовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеООбразовании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УровеньГрамотности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОбразования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразовательныеУчреждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СоциальныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>СоциальныеДанные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоциальныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеООбразовании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОРаботе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеОГражданине.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ДанныеОГражданине</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникАдрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОбАдресе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаПерсональныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПерсональныеДанные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаСоциальныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоциальныеДанные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаДанныеСемьи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОСемье</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочнниаДанныеОСтране</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОСтране</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаНациональности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеОНациональность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код_СправочникаВопросы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ДобавлениеДанныхГражданином/Forms/ФормаДобавленияДанныхГражданином/Ext/Form/Module.bsl
&НаКлиенте	
Процедура Сохранить(Команда)
	Перем Счетчик;
	Счетчик = РазмерСправочника() + 1;
	СоздатьЗапись(Счетчик);	
КонецПроцедуры 


&НаСервере
Функция СоздатьЗапись(ЧислоЗаписей)
	Перем АдресСправочник,ВопросыСправочник,ПерсональныеДанныеСправочник,
	СемьяСправочник,СтранаСправочник,РаботаСправочник,ОбразованиеСправочник,СоциальныеДанныеСправочник,ГражданинСправочник;
	АдресСправочник = Справочники.ДанныеОбАдресе.СоздатьЭлемент();
	АдресСправочник.Код = ЧислоЗаписей;
	АдресСправочник.Наименование = "Адрес Гражданина " + ЧислоЗаписей;
	АдресСправочник.Область = Область;
	АдресСправочник.Регион = Регион;
	АдресСправочник.Улица = Улица;
	АдресСправочник.Дом = Дом;
	АдресСправочник.Строение = Строение;
	АдресСправочник.Записать();
	ВопросыСправочник = Справочники.Вопросы.СоздатьЭлемент();
	ВопросыСправочник.Код = ЧислоЗаписей;
	ВопросыСправочник.Наименование =  "Вопросы " + ЧислоЗаписей;
	ВопросыСправочник.Вопросы = Вопросы;
	ВопросыСправочник.Ответы = Ответы;
	ВопросыСправочник.Записать();
	ПерсональныеДанныеСправочник = Справочники.ПерсональныеДанные.СоздатьЭлемент();
	ПерсональныеДанныеСправочник.Код = ЧислоЗаписей;
	ПерсональныеДанныеСправочник.Наименование = "Гражданин" + ЧислоЗаписей;
	ПерсональныеДанныеСправочник.Пол = Пол;
	ПерсональныеДанныеСправочник.Возраст = Возраст;
	ПерсональныеДанныеСправочник.БрачныйСтатус = БрачныйСтатус;
	ПерсональныеДанныеСправочник.Записать();
	НациональностьСправочник = Справочники.ДанныеОНациональность.СоздатьЭлемент();
	НациональностьСправочник.Код = ЧислоЗаписей;
	НациональностьСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	НациональностьСправочник.Национальность = Национальность;
	НациональностьСправочник.ПервыйЯзык = ПервыйЯзык;
	НациональностьСправочник.Религия = Религия;
	НациональностьСправочник.ДругиеЯзыки = ДругиеЯзыки;
	НациональностьСправочник.Записать();
	СемьяСправочник = Справочники.ДанныеОСемье.СоздатьЭлемент();
	СемьяСправочник.Код = ЧислоЗаписей;
	СемьяСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	СемьяСправочник.ЧленСемьи = ЧленСемьи;
	СемьяСправочник.СтатусЧленаСемьи = СтатусЧленаСемьи;
	СемьяСправочник.Отношение = Отношение;
	СемьяСправочник.СтепеньРодства = СтепеньРодства;
	СемьяСправочник.Записать();
	СтранаСправочник = Справочники.ДанныеОСтране.СоздатьЭлемент();
	СтранаСправочник.Код = ЧислоЗаписей;
	СтранаСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	СтранаСправочник.СтранаРождения = СтранаРождения;
	СтранаСправочник.ДатаМиграции = ДатаМиграции;
	СтранаСправочник.Гражданство = Гражданство;
	СтранаСправочник.Записать();
	РаботаСправочник = Справочники.ДанныеОРаботе.СоздатьЭлемент();
	РаботаСправочник.Код = ЧислоЗаписей;
	РаботаСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	РаботаСправочник.СтатусЭкономическойАктичности = СтатусЭкономическойАктивности;
	РаботаСправочник.РодЗанятий = РодЗанятий;
	РаботаСправочник.Работа = Работа;
	РаботаСправочник.СтатусВозможнойРаботоспособности = СтатусВозможнойРаботоспособности;
	РаботаСправочник.Записать();
	ОбразованиеСправочник = Справочники.ДанныеООбразовании.СоздатьЭлемент();
	ОбразованиеСправочник.Код = ЧислоЗаписей;
	ОбразованиеСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	ОбразованиеСправочник.УровеньГрамотности = УровеньГрамотности;
	ОбразованиеСправочник.УровеньОбразования = УровеньОбразования;
	ОбразованиеСправочник.ОбразовательныеУчреждения = ОбразовательныеУчреждения;
	ОбразованиеСправочник.Записать();
	СоциальныеДанныеСправочник = Справочники.СоциальныеДанные.СоздатьЭлемент();
	СоциальныеДанныеСправочник.Код = ЧислоЗаписей;
	СоциальныеДанныеСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	СоциальныеДанныеСправочник.СоциальныйСтатус = СоциальныйСтатус;
	СоциальныеДанныеСправочник.Код_СправочникаОбразование = Справочники.ДанныеООбразовании.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	СоциальныеДанныеСправочник.Код_СправочникаРабота = Справочники.ДанныеОРаботе.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	СоциальныеДанныеСправочник.Записать();
	ГражданинСправочник = Справочники.ДанныеОГражданине.СоздатьЭлемент();
	ГражданинСправочник.Код = ЧислоЗаписей;
	ГражданинСправочник.Наименование = "Гражданин " + ЧислоЗаписей;
	ГражданинСправочник.ФИО = ФИО;
	ГражданинСправочник.Код_СправочникАдрес = Справочники.ДанныеОбАдресе.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаПерсональныеДанные = Справочники.ПерсональныеДанные.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаСоциальныеДанные = Справочники.СоциальныеДанные.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаДанныеСемьи = Справочники.ДанныеОСемье.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочнниаДанныеОСтране = Справочники.ДанныеОСтране.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаНациональности = Справочники.ДанныеОНациональность.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Код_СправочникаВопросы = Справочники.Вопросы.НайтиПоКоду(ЧислоЗаписей).Ссылка;
	ГражданинСправочник.Записать();
КонецФункции


&НаСервере
Функция РазмерСправочника()
ИмяСправочника = Метаданные.Справочники.ДанныеОГражданине.Имя;
ТекстЗапроса = "ВЫБРАТЬ
| Количество(Справочник.Ссылка) КАК Всего
| ИЗ
| Справочник." + ИмяСправочника + " КАК Справочник";
ЗапросКоличества = Новый Запрос(ТекстЗапроса);
Результат = ЗапросКоличества.Выполнить().Выбрать();
Результат.Следующий();
КоличествоЗаписей = Результат.Всего;
Возврат КоличествоЗаписей;
 КонецФункции
